const wilayas = [
  { name: "أدرار", baladiyas: ["أدرار", "تامست", "رقان", "انزجمير"] },
  { name: "الشلف", baladiyas: ["الشلف", "تنس", "بني حواء", "الزبوجة"] },
  {
    name: "الأغواط",
    baladiyas: ["الأغواط", "قصر الحيران", "حاسي الرمل", "قلتة سيدي سعد"],
  },
  {
    name: "أم البواقي",
    baladiyas: ["أم البواقي", "عين البيضاء", "عين مليلة", "مسكيانة"],
  },
  { name: "باتنة", baladiyas: ["باتنة", "أريس", "بريكة", "عين التوتة"] },
  { name: "بجاية", baladiyas: ["بجاية", "أميزور", "أوقاس", "تيشي"] },
  { name: "بسكرة", baladiyas: ["بسكرة", "طولقة", "أورلال", "جمورة"] },
  { name: "بشار", baladiyas: ["بشار", "بني ونيف", "العبادلة", "تاغيت"] },
  {
    name: "البليدة",
    baladiyas: ["البليدة", "موزاية", "وادي العلايق", "الشفة"],
  },
  {
    name: "البويرة",
    baladiyas: ["البويرة", "سوق الخميس", "سوق الأحد", "عين بسام"],
  },
  { name: "تمنراست", baladiyas: ["تمنراست", "عين امقل", "تازروك", "إينغر"] },
  { name: "تبسة", baladiyas: ["تبسة", "العوينات", "مرسط", "بئر العاتر"] },
  { name: "تلمسان", baladiyas: ["تلمسان", "مغنية", "الغزوات", "ندرومة"] },
  { name: "تيارت", baladiyas: ["تيارت", "فرندة", "مهدية", "سيدي عيسى"] },
  {
    name: "تيزي وزو",
    baladiyas: ["تيزي وزو", "عين الحمام", "تيقزيرت", "أزفون"],
  },
  {
    name: "الجزائر",
    baladiyas: ["الجزائر", "بئر مراد رايس", "الدار البيضاء", "باب الواد"],
  },
  { name: "الجلفة", baladiyas: ["الجلفة", "حاسي بحبح", "عين وسارة", "مسعد"] },
  { name: "جيجل", baladiyas: ["جيجل", "الطاهير", "الميلية", "العوانة"] },
  { name: "سطيف", baladiyas: ["سطيف", "عين ولمان", "العلمة", "بوقاعة"] },
  {
    name: "سعيدة",
    baladiyas: ["سعيدة", "عين الحجر", "سيدي أعمر", "مولاي العربي"],
  },
  { name: "سكيكدة", baladiyas: ["سكيكدة", "عزابة", "الحروش", "رأس الماء"] },
  {
    name: "سيدي بلعباس",
    baladiyas: ["سيدي بلعباس", "تلاغ", "بن باديس", "مستغانم"],
  },
  { name: "عنابة", baladiyas: ["عنابة", "البوني", "الحجار", "سرايدي"] },
  {
    name: "قالمة",
    baladiyas: ["قالمة", "بوشقوف", "هيليوبوليس", "عين مخلوف"],
  },
  {
    name: "قسنطينة",
    baladiyas: ["قسنطينة", "الخروب", "عين عبيد", "زيغود يوسف"],
  },
  {
    name: "المدية",
    baladiyas: ["المدية", "قصر البخاري", "شلالة العذاورة", "البرواقية"],
  },
  {
    name: "مستغانم",
    baladiyas: ["مستغانم", "عين النويصي", "سيدي علي", "حاسي مماش"],
  },
  {
    name: "المسيلة",
    baladiyas: ["المسيلة", "بوسعادة", "سيدي عيسى", "عين الحجل"],
  },
  { name: "معسكر", baladiyas: ["معسكر", "غيليزان", "المحمدية", "تيغنيف"] },
  { name: "ورقلة", baladiyas: ["ورقلة", "تقرت", "الطيبات", "الحجيرة"] },
  { name: "وهران", baladiyas: ["وهران", "السانية", "قديل", "عين الترك"] },
  { name: "البيض", baladiyas: ["البيض", "بريزينة", "الغاسول", "بوقطب"] },
  {
    name: "إليزي",
    baladiyas: ["إليزي", "جانت", "برج عمر إدريس", "إن أمناس"],
  },
  {
    name: "برج بوعريريج",
    baladiyas: ["برج بوعريريج", "رأس الوادي", "بئر قاصد علي", "عين تاغروت"],
  },
  { name: "بومرداس", baladiyas: ["بومرداس", "برج منايل", "زموري", "الثنية"] },
  { name: "الطارف", baladiyas: ["الطارف", "بوحجار", "البسباس", "بوثلجة"] },
  { name: "تندوف", baladiyas: ["تندوف", "أم العسل"] },
  {
    name: "تيسمسيلت",
    baladiyas: ["تيسمسيلت", "ثنية الحد", "برج بونعامة", "الأزهرية"],
  },
  { name: "الوادي", baladiyas: ["الوادي", "الرباح", "البياضة", "الدبيلة"] },
  { name: "خنشلة", baladiyas: ["خنشلة", "أولاد رشاش", "بابار", "تاوزيانت"] },
  {
    name: "سوق أهراس",
    baladiyas: ["سوق أهراس", "مداوروش", "عين الزانة", "تاورة"],
  },
  { name: "تيبازة", baladiyas: ["تيبازة", "شرشال", "القليعة", "حجوط"] },
  {
    name: "ميلة",
    baladiyas: ["ميلة", "فرجيوة", "وادي العثمانية", "شلغوم العيد"],
  },
  {
    name: "عين الدفلى",
    baladiyas: ["عين الدفلى", "خميس مليانة", "جليدة", "العبادية"],
  },
  { name: "النعامة", baladiyas: ["النعامة", "مشرية", "عين الصفراء", "عسلة"] },
  {
    name: "عين تيموشنت",
    baladiyas: ["عين تيموشنت", "حمام بوحجر", "المالح", "ولهاصة"],
  },
  {
    name: "غرداية",
    baladiyas: ["غرداية", "متليلي", "ضاية بن ضحوة", "المنصورة"],
  },
  {
    name: "غليزان",
    baladiyas: ["غليزان", "وادي رهيو", "عمي موسى", "مازونة"],
  },
  { name: "تيميمون", baladiyas: ["تيميمون", "شارط", "طلمين", "أوقروت"] },
  { name: "برج باجي مختار", baladiyas: ["برج باجي مختار", "تيمياوين"] },
  {
    name: "أولاد جلال",
    baladiyas: ["أولاد جلال", "الدوسن", "الشعيبة", "أم الطيور"],
  },
  { name: "بني عباس", baladiyas: ["بني عباس", "كرزاز", "تامترت", "قصابي"] },
  { name: "عين صالح", baladiyas: ["عين صالح", "فقارة الزوى"] },
  { name: "عين قزام", baladiyas: ["عين قزام", "تين زواتين"] },
  { name: "تقرت", baladiyas: ["تقرت", "الطيبات", "تبسبست", "النزلة"] },
  { name: "جانت", baladiyas: ["جانت", "إليزي", "برج الحواس"] },
  { name: "المغير", baladiyas: ["المغير", "سيدي خليل", "جامع", "تڨرت"] },
  { name: "المنيعة", baladiyas: ["المنيعة", "حاسي الفحل"] },
];

export default wilayas;
